app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT * FROM `clients`

  def show
    @client = Client.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 3)

  def create
    #@client = Client.new(params[:client])

    #respond_to do |format|
    #  if @client.save
    #    flash[:notice] = 'Client was successfully created.'
    #    format.html { redirect_to(@client) }
    #    format.xml  { render :xml => @client, :status => :created, :location => @client }
    #  else
    #    format.html { render :action => "new" }
    #    format.xml  { render :xml => @client.errors, :status => :unprocessable_entity }
    #  end
    #end

    @user = get_current_user
    @client = @user.clients.build( params[:client] )

    if @client.save
---
INSERT INTO `clients` (`name`, `updated_at`, `rate`, `user_id`, `created_at`) VALUES('The Racing Forum', '2009-07-17 14:54:58', 20.0, 3, '2009-07-17 14:54:58')

  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 3)
UPDATE `clients` SET `rate` = 60.0, `updated_at` = '2009-07-20 12:21:15' WHERE `id` = 3

  def destroy
    @client = Client.find(params[:id])
    @client.destroy
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 3)
DELETE FROM `clients` WHERE `id` = 3