app/controllers/expenses_controller.rb

SELECT * FROM `expenses`
---
  def index
    @expenses = Expense.all

SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
INSERT INTO `expenses` (`updated_at`, `client_id`, `description`, `amount`, `created_at`) VALUES('2009-07-18 12:24:00', 1, 'Train ticket', 27.0, '2009-07-18 12:24:00')
---
  def create
    #@expense = Expense.new(params[:expense])

    #respond_to do |format|
    #  if @expense.save
    #    flash[:notice] = 'Expense was successfully created.'
    #    format.html { redirect_to(@expense) }
    #    format.xml  { render :xml => @expense, :status => :created, :location => @expense }
    #  else
    #    format.html { render :action => "new" }
    #    format.xml  { render :xml => @expense.errors, :status => :unprocessable_entity }
    #  end
    #end

    @client = Client.find( params[:client_id] )

    @expense = @client.expenses.build( params[:expense] )

    if @expense.save

SELECT * FROM `expenses` WHERE (`expenses`.`id` = 7)
UPDATE `expenses` SET `description` = 'Un-invoiced work: 1hr 15mins', `updated_at` = '2009-07-22 16:35:48' WHERE `id` = 7
---
  def update
    @expense = Expense.find(params[:id])

    respond_to do |format|
      if @expense.update_attributes(params[:expense])

SELECT * FROM `expenses` WHERE (`expenses`.`id` = 6)
DELETE FROM `expenses` WHERE `id` = 6
---
  def destroy
    @expense = Expense.find(params[:id])
    @expense.destroy