app/controllers/feedbacks_controller.rb

  def index
    @feedbacks = Feedback.all
---
SELECT * FROM `feedbacks`

  def create
  	@user = get_current_user
  	@feedback = @user.feedbacks.build( params[:feedback] )

    if @feedback.save
---
INSERT INTO `feedbacks` (`user_id_id`, `message`, `updated_at`, `created_at`) VALUES(NULL, 'Testing!', '2009-07-28 14:00:27', '2009-07-28 14:00:27')