app/controllers/home_controller.rb

SELECT * FROM `users` WHERE (email = 'jsgriffin@imaginaryroots.co.uk' AND password = '8d5114544ce28f5026e4cd9214f05bba') LIMIT 1
---
  def authenticate
  	@user = User.new(params[:userform])
  	valid_user = User.find(:first, :conditions => ["email = ? AND password = ?", @user.email, Digest::MD5.hexdigest( @user.password ) ] )