app/controllers/intervals_controller.rb

SELECT * FROM `intervals` WHERE (`intervals`.`id` = 1)
---
  def show
    @interval = Interval.find(params[:id])

SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
SELECT * FROM `intervals` WHERE (client_id = 1 AND end IS NULL) LIMIT 1
INSERT INTO `intervals` (`updated_at`, `client_id`, `end`, `task`, `start`, `created_at`) VALUES('2009-07-18 12:32:36', 1, NULL, NULL, '2009-07-18 12:32:36', '2009-07-18 12:32:36')
UPDATE `intervals` SET `end` = '2009-07-18 12:46:16', `updated_at` = '2009-07-18 12:46:17' WHERE `id` = 2
---
  def create
  	if params[:client][:id].empty?
  		flash[:notice] = 'Please select a client'
	    redirect_to "/dashboard"
	    return false
  	end

  	@client = Client.find( params[:client][:id] )

  	if params[:int_action] == "start"
	    @interval = @client.intervals.build
		@interval.start = Time.zone.now
	else
		@interval = Interval.find( :first, :conditions => ["client_id = ? AND end IS NULL", @client.id] )
		@interval.end = Time.zone.now
	end

	@interval.save

SELECT * FROM `intervals` WHERE (`intervals`.`id` = 17)
UPDATE `intervals` SET `start` = '2009-07-22 16:37:00', `end` = '2009-07-22 16:40:00', `updated_at` = '2009-07-22 16:48:21' WHERE `id` = 17
---
  def update
    @interval = Interval.find(params[:id])

    respond_to do |format|
      if @interval.update_attributes(params[:interval])

SELECT * FROM `intervals` WHERE (`intervals`.`id` = 16)
DELETE FROM `intervals` WHERE `id` = 16
---
  def destroy
    @interval = Interval.find(params[:id])
    @interval.destroy