app/controllers/internal_controller.rb

SELECT * FROM `clients` WHERE (user_id = 4) ORDER BY name
SELECT * FROM `clients` WHERE (`clients`.`id` = 5)
---
  def dashboard
  	@user = get_current_user

  	if params[:options]
  		@chosen_clients = []
  		params[:options][:clients].each do |client|
  			if client[1] == 'on'
	  			@chosen_clients.push client[0]
  			end
  		end
  		@clients = Client.find( :all, :conditions=>["user_id = ? AND id IN (#{@chosen_clients.join(',')})", session[:user_id] ], :order=>'name' )

SELECT * FROM `intervals` WHERE (end IS NULL AND client_id IN (SELECT id FROM clients WHERE user_id = 4)) LIMIT 1
SELECT * FROM `expenses` WHERE (`expenses`.client_id = 3) ORDER BY created_at DESC
---
				@end = 1.month.ago
			end

			@intervals = @clients[i].intervals.find( :all, :conditions=>[ "start >= ? AND end <= ?", @start, @end ] )
			@expenses = @clients[i].expenses.find( :all, :conditions=>[ "created_at >= ? AND created_at <= ?", @start, @end ] )