app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM `users` WHERE (id = 8) LIMIT 1

  def create
	params[:user][:password] = encode( params[:user][:password] )
	params[:user][:level] = 'F'
    @user = User.new(params[:user])

	@existing = User.find( :all, :conditions=>["email = ?", params[:user][:email] ] )

	if @existing.size > 0
		flash[:notice] = "Someone with that email address is already registered. Please choose another email address, <a href=\"/login\">Login</a> or <a href=\"/users/forgotten\">reset your password</a>."
		render :action=>"new"
		return false
	end

    if @user.save
---
SELECT * FROM `users` WHERE (email = 'jsgriffin@imaginaryroots.co.uk')
INSERT INTO `users` (`name`, `updated_at`, `timezone`, `level`, `password`, `email`, `created_at`) VALUES('Dave', '2009-07-29 10:41:05', 'London', 'F', 'ae2b1fca515949e5d54fb22b8ed95575', 'jsgriffin@gmail.com', '2009-07-29 10:41:05')

  def update
    @user = User.find(params[:id])

	if params[:user][:password].blank?
		params[:user][:password] = @user.password
	elsif params[:user][:password] != params[:password_2]
		flash[:notice] = "Your passwords did not match"
		render :action=>"edit"
		return false
	else
		params[:user][:password] = encode( params[:user][:password] )
	end

    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 4)
UPDATE `users` SET `password` = 'c5d86b6ff20ed131f9cedd842d187e78', `updated_at` = '2009-07-28 14:40:07', `name` = 'James Griffin' WHERE `id` = 4